# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('file:///Users/bbjang/Documents/LaunchCodeProjects/codergirl-python/baby-names.csv')
baby_names

    Unnamed: 0     Id       Name  Year Gender State  Count
0        11349  11350       Emma  2004      F    AK   62.0
1        11350  11351    Madison  2004      F    AK   48.0
2        11351  11352     Hannah  2004      F    AK   46.0
3        11352  11353      Grace  2004      F    AK   44.0
4        11353  11354      Emily  2004      F    AK   41.0
5        11354  11355    Abigail  2004      F    AK   37.0
6        11355  11356     Olivia  2004      F    AK   33.0
7        11356  11357   Isabella  2004      F    AK   30.0
8        11357  11358     Alyssa  2004      F    AK   29.0
9        11358  11359     Sophia  2004      F    AK   28.0
10       11359  11360     Alexis  2004      F    AK   27.0
11       11360  11361  Elizabeth  2004      F    AK   27.0
12       11361  11362     Hailey  2004      F    AK   27.0
13       11362  11363       Anna  2004      F    AK   26.0
14       11363  11364    Natalie    20    NaN   NaN    NaN

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK   62.0
1   Madison  2004      F    AK   48.0
2    Hannah  2004      F    AK   46.0
3     Grace  2004      F    AK   44.0
4     Emily  2004      F    AK   41.0
5   Abigail  2004      F    AK   37.0
6    Olivia  2004      F    AK   33.0
7  Isabella  2004      F    AK   30.0
8    Alyssa  2004      F    AK   29.0
9    Sophia  2004      F    AK   28.0

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [3]:
baby_names.drop(columns=['Unnamed: 0', 'Id'], inplace=True)
baby_names

         Name  Year Gender State  Count
0        Emma  2004      F    AK   62.0
1     Madison  2004      F    AK   48.0
2      Hannah  2004      F    AK   46.0
3       Grace  2004      F    AK   44.0
4       Emily  2004      F    AK   41.0
5     Abigail  2004      F    AK   37.0
6      Olivia  2004      F    AK   33.0
7    Isabella  2004      F    AK   30.0
8      Alyssa  2004      F    AK   29.0
9      Sophia  2004      F    AK   28.0
10     Alexis  2004      F    AK   27.0
11  Elizabeth  2004      F    AK   27.0
12     Hailey  2004      F    AK   27.0
13       Anna  2004      F    AK   26.0
14    Natalie    20    NaN   NaN    NaN

### Step 6. Are there more male or female names in the dataset?

In [8]:
baby_names.groupby(['Gender']).count().Name

Gender
F    14
Name: Name, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [12]:
names = baby_names.groupby('Name').Count.sum().sort_values(ascending=False)
names

Name
Emma         62.0
Madison      48.0
Hannah       46.0
Grace        44.0
Emily        41.0
Abigail      37.0
Olivia       33.0
Isabella     30.0
Alyssa       29.0
Sophia       28.0
Hailey       27.0
Elizabeth    27.0
Alexis       27.0
Anna         26.0
Natalie       0.0
Name: Count, dtype: float64

### Step 8. How many different names exist in the dataset?

In [16]:
baby_names['Name'].nunique()

15

### Step 9. What is the name with most occurrences?

'Jacob'

### Step 10. How many different names have the least occurrences?

In [9]:
least_names = baby_names.groupby('Name').Count.sum().reset_index()
least_names[least_names['Count']==5]

2578

### Step 11. What is the median name occurrence?

In [17]:
# baby_names.groupby('Name').Count.median()

np.std(least_names['Count'])

Name
Abigail      37.0
Alexis       27.0
Alyssa       29.0
Anna         26.0
Elizabeth    27.0
Emily        41.0
Emma         62.0
Grace        44.0
Hailey       27.0
Hannah       46.0
Isabella     30.0
Madison      48.0
Natalie       NaN
Olivia       33.0
Sophia       28.0
Name: Count, dtype: float64

### Step 12. What is the standard deviation of names?

In [11]:
np.std(least_names['Count'])

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [18]:
least_name.describe()

NameError: name 'least_names' is not defined